sdaiValidateWhereRuleBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether the where rule with specified name is satisfied by the specified application instance.
\param instance [in] Identifier of the application instance to be validated.
\param ruleName [in] Name of where rule to check.
\returns sdaiTRUE if where rule is satisfied by application instance; the function returns sdaiFALSE if rule is not satisfied,
or sdaiUNKNOWN if where rule can not be evaluated.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiRU_NDEF - Rule not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance cp1 = sdaiCreateInstanceBN(model, "ifccartesianpoint");
SdaiAggr coordinates = sdaiCreateAggrBN(cp1, "coordinates");
sdaiPutAggrByIndex(coordinates, 0, sdaiREAL, 1.);
SdaiLogical check1 = sdaiValidateWhereRuleBN(cp1, "CP2Dor3D"); //sdaiFALSE